#include <stdio.h>
#include <stdlib.h>
#include <time.h>
#include <stdbool.h>

int main() {

    int nivel;
    int chute;
    int tentativas;
    int ultimo_numero;
    int jogarnovamente;
    double pontos = 1000;
    int intervalo1, intervalo2;
    

    int a = abs(-10);
    int b = abs(10);
    int x = 10;
    int y = abs(x);
 
    printf("\n\n");
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");
    printf("█▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█\n");
    printf("█░██░██░██░██░██░██░██░██░██░░░░░░░░░░█\n");
    printf("█░██░██░██░██░██░██░██░██░██░░░░░░░░░░█\n");
    printf("█▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄█\n");
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");
    printf("░░█░░░░█▀▀▀█░█▀▀█░█▀▀▄░▀█▀░█▄░░█░█▀▀█░░\n");
    printf("░░█░░░░█░░░█░█▄▄█░█░░█░░█░░█░█░█░█░▄▄░░\n");
    printf("░░█▄▄█░█▄▄▄█░█░░█░█▄▄▀░▄█▄░█░░▀█░█▄▄█░░\n");
    printf("░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░\n");
    printf("\n\n");
    printf("************************************\n");
    printf("* Bem-vindo ao jogo de Adivinhação *\n");
    printf("************************************\n\n");
    

  while (true){
    int nivel;
    double pontos = 1000;

    printf("\nEscolha o intervalo em que você deseja adivinhar o número secreto.\n");
    printf("Intervalo 1: ");
    scanf("%d", &intervalo1);
    printf("Intervalo 2: ");
    scanf("%d", &intervalo2);

    srand(time(NULL)); 

    int min = intervalo1 < intervalo2 ? intervalo1 : intervalo2;
    int max = intervalo1 > intervalo2 ? intervalo1 : intervalo2;
    int numeroSecreto = (rand() % (max - min + 1)) + min;

    while (numeroSecreto == ultimo_numero) {
        numeroSecreto = (rand() % (max - min + 1)) + min;
    }
    ultimo_numero = numeroSecreto;

    printf("\nEscolha qual o nível da dificuldade.\n");
    printf("\n(1)Fácil (2)Médio (3)Difícil\n\n");
    printf("Escolha: ");
    scanf("%d", &nivel);

    switch (nivel){
    case 1:
        tentativas = 15;
        break;
    case 2:
        tentativas = 10;
        break;
    case 3:
        tentativas = 5;
        break;
    }
       
        for (int i = 1; i <= tentativas; i++){
            printf("\n%dº tentativa de %d\n", i, tentativas);
            printf("Digite seu chute: ");
            scanf("%d", &chute);

            if(chute < 0){
                printf("\nVocê não pode digitar números negativos.\n");
                i--;
                continue;
            }

            if (chute < min || chute > max){
                printf("\nVocê deve digitar um número entre %d e %d.\n", min, max);
                i--;
                continue;
            }
            
            int diferenca = abs(chute - numeroSecreto);

            if (chute == numeroSecreto){
                break;
            }
            else if (diferenca <= 3){
                    printf("\n🔥 Muito quente! Você está colado nele!\n");
                }
            else if (diferenca <= 6){
                    printf("\n✨ Quente! Você está perto!\n");
                }
            else{
                printf("\n❄️ Frio... Você está longe de acertar.\n");
            }

            double pontosperdidos = abs(chute - numeroSecreto)/2.0;
            pontos = pontos - pontosperdidos;

        }

            printf("\n");
            if (chute == numeroSecreto){
                printf("░░░░░░░░░░░░░░░░░░░▄▄░░░░░░░░░░░░░░░░░░░\n"); printf
                ("░░░░░░░░░░░░░░░░░▄▄██▄▄░░░░░░░░░░░░░░░░░\n"); printf
                ("░░░░░░░░░░░░░░░░░▀▀██▀▀░░░░░░░░░░░░░░░░░\n"); printf
                ("░░░░░░░░▄▄▄███████▄██▄███████▄▄▄░░░░░░░░\n"); printf
                ("░░░░▄█████▀▄░░▀░░██████░░▀░░▄▀█████▄░░░░\n"); printf
                ("░░▄█▀▀░██░░░░░░░░░░██▀░░░░░░░░░██░▀▀█▄░░\n"); printf
                ("░██░░▄██▀▀░░░░░░░░░██░░░░░░░░░▀▀██▄░▀██░\n"); printf
                ("██░░░░██░░░░░░░░░░░██░░░░░░░░░░░██░░░░██   Parabéns, Você acertou!\n"); printf
                ("██░█░░██▀▀░░░░░░░░░██░░░░░░░░░▀▀██░░█░██   Você fez %.1f pontos!\n",pontos); printf
                ("██░░░░▀██▄░░░░░░░░░██░░░░░░░░░▄██▀░░░░██\n"); printf
                ("░██░▀░░▀██▀░░░░░░▄████▄░░░░░░▀▄█▀░░▀░██░\n"); printf
                ("░▀██░░▄░▀██▀▄░░░░██▄▄██░░░░▄▀██▀░▄░▄██▀░\n"); printf
                ("░░░██▄▄▄▄██████████████████████▄▄▄▄█▀░░░\n"); printf
                ("░░░░█▀▀▀▀▀▀░░▄▄▄▄▄░░░░▄▄▄▄▄░░▀▀▀▀▀▀█░░░░\n"); printf
                ("░░░░░███░░░░░▀███░░░░░░███▀░░░░░███░░░░░\n"); printf
                ("░░░░░▀██▄░░░░▀▀▀▀▀░░░░▀▀▀▀▀░░░░▄██▀░░░░░\n"); printf
                ("░░░░░▄▄▄▄██████████████████████▄▄▄▄░░░░░\n"); printf
                ("░░░░░░▀▀▀▀░░░░░░░░░░░░░░░░░░░░▀▀▀▀░░░░░░\n");
                printf("\n");
            

            } else{
                printf("████████████▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀█████████\n"); printf
                ("█████▀▀░░░░░░░░░░░░░░░░░░░░░░░░░▀███████\n"); printf
                ("████░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░██████\n"); printf
                ("███▀░░░░░▄▄▄░░░░░░░░▄▄▀███▄▄░░░░░░░█████\n"); printf
                ("██░░░░░░▀▀▀███▄▄░░░█▄▄█▀█▀▀▀▀░▀░▄▄░▀▀███\n"); printf
                ("█░░▄▄░▄▄░▄░░░█▀░░░░░░░░░░▀▄▄▄█▀▀▄░▀█░░▀█\n"); printf
                ("█░░░░▄░▀▀░░▄█▀░░░░░░▄▄░░░░░░░▄▄▀██▄░█░░█    O número secreto era: %d\n", numeroSecreto); printf
                ("██░░░██░░░▀▀█▄░░░▀▀▀▄▀░▄▄▄███▀░▄█░░░▀░▄█    Você perdeu! Tente novamente.\n"); printf
                ("██▄░██▀█▀▄▄▄▄▄█▄▄▄▄▄▀▀█▀░░▄███▀█▀░░░▄▄██\n"); printf
                ("███░████▄█▄░░█░░▄█░░▄▄███▀▀▀█▄▀░░░░▄████\n"); printf
                ("███░▀██████████████▀▀▀▀█░░░▄▀▀░░░░▄█████\n"); printf
                ("███░░██▀█▀██▀█▀░░▀█░░░░█▄█▀░░░░░▄███████\n"); printf
                ("███░░░░▀▀▀██▄██▄▄██▀▀▀▀▀░░░░░▄▄█████████\n"); printf
                ("██▀░░░░░░░░░░░░░░░░░░░░░░▄▄▄████████████\n"); printf
                ("██▄░░░░░░░░░░░░░░░░░░▄▄█████████████████\n"); printf
                ("████▄░░░░░░░░░▄▄▄▄▄█████████████████████\n"); printf
                ("████████████████████████████████████████\n");

        }

        printf("Digite (1) Para jogar novamente ou (2) Para sair\n");
        printf("Digite:");
        scanf("%d", &jogarnovamente);

        if (jogarnovamente == 2){
            printf("Obrigado por jogar!\n");
            break;
        }
    
       
            

    }
  
} 
